// Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 
//48 -> 2, 4, 6, 8

Console.WriteLine("Chislo1");
int numberA = Convert.ToInt32(Console.ReadLine());
